In [1]:
import numpy as np
import pandas as pd

# Object creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

#### Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

In [9]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.480664 -0.514832  0.347266  0.112716
2013-01-02 -0.332238 -0.032220  0.670438 -0.838964
2013-01-03  0.981983 -0.333164  1.053436 -0.839390
2013-01-04  1.381784 -1.952747 -1.447570 -0.268859
2013-01-05 -0.745796  0.007535  0.066975 -1.515501
2013-01-06 -0.465755  1.634476 -0.006371 -1.101159

#### Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [10]:
df2 = pd.DataFrame(
        {
            "A": 1.0,
            "B": pd.Timestamp("20130102"),
            "C": pd.Series(1, index=list(range(4)), dtype="float32"),
            "D": np.array([3] * 4, dtype="int32"),
            "E": pd.Categorical(["test", "train", "test", "train"]),
            "F": "foo",
        }
    )

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [12]:
# The columns of the resulting DataFrame have different dtypes.
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing data

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.857574  3.172881  0.342224  1.541875
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463
2013-01-04 -1.084408  0.383509  1.635871  1.606590
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090

In [14]:
df.tail()

                   A         B         C         D
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463
2013-01-04 -1.084408  0.383509  1.635871  1.606590
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090
2013-01-06  1.513139 -0.420288  0.002861 -0.773534

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
# DataFrame.to_numpy() gives a NumPy representation of the underlying data
df.to_numpy()

array([[-8.57573809e-01,  3.17288125e+00,  3.42223804e-01,
         1.54187510e+00],
       [ 4.17077481e-01,  2.83222281e-03, -9.58747247e-01,
        -7.68612621e-01],
       [ 2.35603998e+00,  2.03691148e+00, -8.28551728e-01,
         6.74462767e-01],
       [-1.08440794e+00,  3.83508829e-01,  1.63587135e+00,
         1.60658972e+00],
       [-7.01425945e-01, -4.76983947e-01,  1.83543055e+00,
        -4.32090493e-01],
       [ 1.51313860e+00, -4.20287946e-01,  2.86065117e-03,
        -7.73533542e-01]])

In [18]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.273808  0.783144  0.338181  0.308115
std    1.411950  1.489130  1.190084  1.115314
min   -1.084408 -0.476984 -0.958747 -0.773534
25%   -0.818537 -0.314508 -0.620699 -0.684482
50%   -0.142174  0.193171  0.172542  0.121186
75%    1.239123  1.623561  1.312459  1.325022
max    2.356040  3.172881  1.835431  1.606590

In [20]:
# Transposing data
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.857574    0.417077    2.356040   -1.084408   -0.701426    1.513139
B    3.172881    0.002832    2.036911    0.383509   -0.476984   -0.420288
C    0.342224   -0.958747   -0.828552    1.635871    1.835431    0.002861
D    1.541875   -0.768613    0.674463    1.606590   -0.432090   -0.773534

In [21]:
# Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.541875  0.342224  3.172881 -0.857574
2013-01-02 -0.768613 -0.958747  0.002832  0.417077
2013-01-03  0.674463 -0.828552  2.036911  2.356040
2013-01-04  1.606590  1.635871  0.383509 -1.084408
2013-01-05 -0.432090  1.835431 -0.476984 -0.701426
2013-01-06 -0.773534  0.002861 -0.420288  1.513139

In [22]:
# Sorting by values
df.sort_values(by="B")

                   A         B         C         D
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090
2013-01-06  1.513139 -0.420288  0.002861 -0.773534
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-04 -1.084408  0.383509  1.635871  1.606590
2013-01-03  2.356040  2.036911 -0.828552  0.674463
2013-01-01 -0.857574  3.172881  0.342224  1.541875

# Selection

## Getting

In [23]:
# Selecting a single column, which yields a Series, equivalent to df.A:
df["A"]

2013-01-01   -0.857574
2013-01-02    0.417077
2013-01-03    2.356040
2013-01-04   -1.084408
2013-01-05   -0.701426
2013-01-06    1.513139
Freq: D, Name: A, dtype: float64

In [24]:
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01 -0.857574  3.172881  0.342224  1.541875
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463

In [25]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463
2013-01-04 -1.084408  0.383509  1.635871  1.606590

## Selection by label

In [26]:
# For getting a cross section using a label:
df.loc[dates[0]]

A   -0.857574
B    3.172881
C    0.342224
D    1.541875
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
# Selecting on a multi-axis by label:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.857574  3.172881
2013-01-02  0.417077  0.002832
2013-01-03  2.356040  2.036911
2013-01-04 -1.084408  0.383509
2013-01-05 -0.701426 -0.476984
2013-01-06  1.513139 -0.420288

In [28]:
# Showing label slicing, both endpoints are included:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.417077  0.002832
2013-01-03  2.356040  2.036911
2013-01-04 -1.084408  0.383509

In [29]:
# Reduction in the dimensions of the returned object:
df.loc["20130102", ["A", "B"]]

A    0.417077
B    0.002832
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
# For getting a scalar value:
df.loc[dates[0], "A"]

-0.8575738091562717

In [31]:
# For getting fast access to a scalar (equivalent to the prior method):
df.at[dates[0], "A"]

-0.8575738091562717

## Selection by position

In [32]:
# Select via the position of the passed integers:
df.iloc[3]

A   -1.084408
B    0.383509
C    1.635871
D    1.606590
Name: 2013-01-04 00:00:00, dtype: float64

In [33]:
# By integer slices, acting similar to NumPy/Python:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.084408  0.383509
2013-01-05 -0.701426 -0.476984

In [34]:
# By lists of integer position locations, similar to the NumPy/Python style:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.417077 -0.958747
2013-01-03  2.356040 -0.828552
2013-01-05 -0.701426  1.835431

In [35]:
# For slicing rows explicitly:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463

In [36]:
# For slicing columns explicitly:
df.iloc[:, 1:3]

                   B         C
2013-01-01  3.172881  0.342224
2013-01-02  0.002832 -0.958747
2013-01-03  2.036911 -0.828552
2013-01-04  0.383509  1.635871
2013-01-05 -0.476984  1.835431
2013-01-06 -0.420288  0.002861

In [37]:
# For getting a value explicitly:
df.iloc[1, 1]

0.0028322228078385995

In [38]:
# For getting fast access to a scalar (equivalent to the prior method):
df.iat[1, 1]

0.0028322228078385995

# Boolean indexing

In [39]:
# Using a single column’s values to select data.
df[df["A"] > 0]

                   A         B         C         D
2013-01-02  0.417077  0.002832 -0.958747 -0.768613
2013-01-03  2.356040  2.036911 -0.828552  0.674463
2013-01-06  1.513139 -0.420288  0.002861 -0.773534

In [40]:
# Selecting values from a DataFrame where a boolean condition is met.
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  3.172881  0.342224  1.541875
2013-01-02  0.417077  0.002832       NaN       NaN
2013-01-03  2.356040  2.036911       NaN  0.674463
2013-01-04       NaN  0.383509  1.635871  1.606590
2013-01-05       NaN       NaN  1.835431       NaN
2013-01-06  1.513139       NaN  0.002861       NaN

In [42]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01 -0.857574  3.172881  0.342224  1.541875    one
2013-01-02  0.417077  0.002832 -0.958747 -0.768613    one
2013-01-03  2.356040  2.036911 -0.828552  0.674463    two
2013-01-04 -1.084408  0.383509  1.635871  1.606590  three
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090   four
2013-01-06  1.513139 -0.420288  0.002861 -0.773534  three

In [43]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  2.356040  2.036911 -0.828552  0.674463   two
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090  four

## Setting

In [45]:
# Setting a new column automatically aligns the data by the indexes.
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df["F"] = s1

In [47]:
# Setting values by label:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  3.172881  0.342224  1.541875  NaN
2013-01-02  0.417077  0.002832 -0.958747 -0.768613  1.0
2013-01-03  2.356040  2.036911 -0.828552  0.674463  2.0
2013-01-04 -1.084408  0.383509  1.635871  1.606590  3.0
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090  4.0
2013-01-06  1.513139 -0.420288  0.002861 -0.773534  5.0

In [48]:
# Setting values by position:
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.342224  1.541875  NaN
2013-01-02  0.417077  0.002832 -0.958747 -0.768613  1.0
2013-01-03  2.356040  2.036911 -0.828552  0.674463  2.0
2013-01-04 -1.084408  0.383509  1.635871  1.606590  3.0
2013-01-05 -0.701426 -0.476984  1.835431 -0.432090  4.0
2013-01-06  1.513139 -0.420288  0.002861 -0.773534  5.0

In [49]:
# Setting by assigning with a NumPy array:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.342224  5  NaN
2013-01-02  0.417077  0.002832 -0.958747  5  1.0
2013-01-03  2.356040  2.036911 -0.828552  5  2.0
2013-01-04 -1.084408  0.383509  1.635871  5  3.0
2013-01-05 -0.701426 -0.476984  1.835431  5  4.0
2013-01-06  1.513139 -0.420288  0.002861  5  5.0

In [50]:
# A where operation with setting.
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.342224 -5  NaN
2013-01-02 -0.417077 -0.002832 -0.958747 -5 -1.0
2013-01-03 -2.356040 -2.036911 -0.828552 -5 -2.0
2013-01-04 -1.084408 -0.383509 -1.635871 -5 -3.0
2013-01-05 -0.701426 -0.476984 -1.835431 -5 -4.0
2013-01-06 -1.513139 -0.420288 -0.002861 -5 -5.0

# Missing data

#### Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [51]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [52]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [53]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.342224  5  NaN  1.0
2013-01-02  0.417077  0.002832 -0.958747  5  1.0  1.0
2013-01-03  2.356040  2.036911 -0.828552  5  2.0  NaN
2013-01-04 -1.084408  0.383509  1.635871  5  3.0  NaN

In [54]:
# To drop any rows that have missing data.
df1.dropna(how="any")

                   A         B         C  D    F    E
2013-01-02  0.417077  0.002832 -0.958747  5  1.0  1.0

In [55]:
# Filling missing data.
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.342224  5  5.0  1.0
2013-01-02  0.417077  0.002832 -0.958747  5  1.0  1.0
2013-01-03  2.356040  2.036911 -0.828552  5  2.0  5.0
2013-01-04 -1.084408  0.383509  1.635871  5  3.0  5.0

In [56]:
# To get the boolean mask where values are nan.
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

## Stats

#### Operations in general exclude missing data

In [57]:
# Performing a descriptive statistic:
df.mean()

A    0.416737
B    0.254330
C    0.338181
D    5.000000
F    3.000000
dtype: float64

In [58]:
# Same operation on the other axis:
df.mean(1)

2013-01-01    1.335556
2013-01-02    1.092232
2013-01-03    2.112880
2013-01-04    1.786994
2013-01-05    1.931404
2013-01-06    2.219142
Freq: D, dtype: float64